USE [ConsentManagementDB]
GO

INSERT INTO [dbo].[ConsentForm]
           ([consent_form_id]
           ,[consent_form_name]
           ,[consent_title]
           ,[consent_form_header]
           ,[consent_form_footer]
           ,[consent_form_version]
           ,[create_date]
           ,[use_status]
           ,[remark])
     VALUES
           ('6C074227-BE2C-4592-8775-26932ACA5DDE'
           ,'ASP_CONSENT_THAI_1'
           ,'หนังสือยินยอมของลูกค้า'
           ,'โปรดแจ้งให้บริษัททราบถึงความพึงพอใจและความตกลงของท่านตามที่ปรากฏด้านล่างนี้ คำที่นิยามไว้ในนโยบายความเป็นส่วนตัวของบริษัท เอเซีย พลัส กรุ๊ป โฮลดิ้งส์ จำกัด (มหาชน) และบริษัทในเครือจะมีความหมายเช่นเดียวกันเมื่อใช้ในเอกสารฉบับนี้ เว้นแต่นิยามไว้เป็นอย่างอื่นในเอกสารฉบับนี้'
           ,''
           ,'1.00'
           ,getdate()
           ,'Y'
           ,''
		   )
GO

INSERT INTO [dbo].[ConsentSystemAllow]
           ([consent_form_id]
           ,[system_name]
           ,[system_ip_address]
           ,[use_status]
           ,[remark])
     VALUES
           ('6C074227-BE2C-4592-8775-26932ACA5DDE'
           ,'SystemTest'
           ,'172.20.33.72'
           ,'Y'
           ,'')
		   ,('6C074227-BE2C-4592-8775-26932ACA5DDE'
           ,'CNMS'
           ,'172.20.33.72'
           ,'Y'
           ,'')
		   ,('6C074227-BE2C-4592-8775-26932ACA5DDE'
           ,'aspsmart'
           ,'172.20.33.72'
           ,'Y'
           ,'')
GO

insert into [dbo].[UserPermissionControl]
values('CustomerAcceptedConsents','suchin@asiaplus.co.th')
		,('UsersManagement','suchin@asiaplus.co.th')
		,('DashBoard','suchin@asiaplus.co.th')

GO

INSERT INTO [dbo].[consentdetail]
           ([consent_id]
           ,[consent_form_id]
           ,[title_name]
           ,[consent_order]
           ,[content_html]
           ,[content_text]
           ,[remark]
           ,[create_date])
     VALUES
           ('5D3E3EC1-9F06-4E33-81B1-B3485C44335D'
           ,'6C074227-BE2C-4592-8775-26932ACA5DDE'
           ,''
           ,'1'
           ,'ข้าพเจ้าได้อ่านและตกลงตาม<U><a href="https://inv4.asiaplus.co.th/asps/disclaimer.php" target="_blank">ข้อกำหนดและเงื่อนไข</a></U>และรับทราบ<U><a href="https://inv4.asiaplus.co.th/asps/policy.php" target="_blank">นโยบายความเป็นส่วนตัว</a></U>  (support@asiaplus.co.th หรือ dpo@asiaplus.co.th) ซึ่งระบุถึงวิธีการที่ บริษัท เอเซีย พลัส กรุ๊ป โฮลดิ้งส์ จำกัด (มหาชน) และบริษัทในเครือ    ("บริษัท") จะเก็บรวบรวม ใช้ เปิดเผย และ/หรือโอนข้อมูลส่วนบุคคลและข้อมูลที่ละเอียดอ่อนของข้าพเจ้าไปยังต่างประเทศแล้ว'
           ,'ข้าพเจ้าได้อ่านและตกลงตามข้อกำหนดและเงื่อนไข และรับทราบนโยบายความเป็นส่วนตัว (support@asiaplus.co.th หรือ dpo@asiaplus.co.th) ซึ่งระบุถึงวิธีการที่ บริษัท เอเซีย พลัส กรุ๊ป โฮลดิ้งส์ จำกัด (มหาชน) และบริษัทในเครือ    ("บริษัท") จะเก็บรวบรวม ใช้ เปิดเผย และ/หรือโอนข้อมูลส่วนบุคคลและข้อมูลที่ละเอียดอ่อนของข้าพเจ้าไปยังต่างประเทศแล้ว'
           ,''
           ,GETDATE()),
		   ('40120A0E-9081-4FED-853A-DFDA90E81542'
           ,'6C074227-BE2C-4592-8775-26932ACA5DDE'
           ,''
           ,'2'
           ,'ข้าพเจ้ายินยอมให้มีการเก็บรวบรวม ใช้ และ/หรือเปิดเผยข้อมูลส่วนบุคคลของข้าพเจ้า เพื่อวัตถุประสงค์ในการรับการติดต่อสื่อสารทางการตลาด ข้อเสนอพิเศษ เอกสารส่งเสริมการขายที่เกี่ยวกับผลิตภัณฑ์และบริการของบริษัท บริษัทในเครือและบริษัทย่อยของบริษัท และบุคคลภายนอกซึ่งบริษัทไม่สามารถอาศัยหลักเกณฑ์หรือฐานทางกฎหมายอื่น'
           ,'ข้าพเจ้ายินยอมให้มีการเก็บรวบรวม ใช้ และ/หรือเปิดเผยข้อมูลส่วนบุคคลของข้าพเจ้า เพื่อวัตถุประสงค์ในการรับการติดต่อสื่อสารทางการตลาด ข้อเสนอพิเศษ เอกสารส่งเสริมการขายที่เกี่ยวกับผลิตภัณฑ์และบริการของบริษัท บริษัทในเครือและบริษัทย่อยของบริษัท และบุคคลภายนอกซึ่งบริษัทไม่สามารถอาศัยหลักเกณฑ์หรือฐานทางกฎหมายอื่น'
           ,''
           ,GETDATE()),
		   ('6DABE227-3A56-4FA7-BDFE-76C2BE2844EA'
           ,'6C074227-BE2C-4592-8775-26932ACA5DDE'
           ,''
           ,'3'
           ,'ข้าพเจ้ายินยอมให้มีการเก็บรวบรวม ใช้ และ/หรือเปิดเผยข้อมูลที่ละเอียดอ่อนของข้าพเจ้า เพื่อวัตถุประสงค์ที่ระบุใน<a href="https://inv4.asiaplus.co.th/asps/policy.php" target="_blank">นโยบายความเป็นส่วนตัว</a>'
           ,'ข้าพเจ้ายินยอมให้มีการเก็บรวบรวม ใช้ และ/หรือเปิดเผยข้อมูลที่ละเอียดอ่อนของข้าพเจ้า เพื่อวัตถุประสงค์ที่ระบุในนโยบายความเป็นส่วนตัว (support@asiaplus.co.th หรือ dpo@asiaplus.co.th)'
           ,''
           ,GETDATE()),
		   ('5548F26A-E91E-4564-A60F-4C9577609B0F'
           ,'6C074227-BE2C-4592-8775-26932ACA5DDE'
           ,''
           ,'4'
           ,'ข้าพเจ้ายินยอมให้มีการโอนข้อมูลส่วนบุคคลของข้าพเจ้าไปยังประเทศซึ่งอาจไม่มีระดับการคุ้มครองข้อมูลที่เพียงพอ ซึ่งกฎหมายกำหนดให้ต้องได้รับความยินยอม'
           ,'ข้าพเจ้ายินยอมให้มีการโอนข้อมูลส่วนบุคคลของข้าพเจ้าไปยังประเทศซึ่งอาจไม่มีระดับการคุ้มครองข้อมูลที่เพียงพอ ซึ่งกฎหมายกำหนดให้ต้องได้รับความยินยอม'
           ,''
           ,GETDATE())
GO